Repository: nouran-98/SampleFiles
Catalog: tm_tmx.tmx
Source language: en
Languages: ar

source: Upon completion of this level, you can understand and use familiar everyday expressions and very basic phrases.
ar: xx

source: for social, academic, and professional purposes.
ar: tتستستست تستستت تستست تتستس تسست

source: (e.g. very basic personal and family information, shopping, local geography, employment).
ar: tt

source: encountered in work, school, leisure, etc. You can deal with most situations likely to arise whilst travelling in an area
ar: rr

source: including technical discussions in your field of specialisation. You can interact with a degree of fluency and
ar: a

source: advantages and disadvantages of various options. You are ready for the Zertifikat Deutsch für den Beruf (
ar: r

source: Completing this level means you can understand a wide range of demanding, longer texts, and recognise implicit meaning.
ar: r

source: Reaching the end of this level you have shown that you can easily understand virtually everything heard or read. You can summarise
ar: تتتتستتستت

source: You can express yourself spontaneously, very fluently
ar: hello
